Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_260-The_Akasagarbha_Sutra-v1.tmx
Source language: bo
Languages: en

source: །ཡོངས་སུ་བརྟག་པ་བཟུང་ན་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་རྒྱུན་དུ་ཞུགས་པར་གྱུར་ན་ཡང་
en: Imagine that all sentient beings had become stream-enterers.

source: །ལ་ལར་ནི་བྲམ་ཟེའི་གཟུགས་སུ་བྱེད་ཅིང་།
en: sometimes in the form of a brahmin.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་སེམས་ཅན་ཐམས་ཅད་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་རྒྱུན་དུ་ཞུགས་པ་གཅིག་གི་སྤྱོད་ཡུལ་དང་། སྦྱོར་བ་དང་། རྣམ་པར་གྲོལ་བ་མི་ཤེས་སོ།
en: However many immature, ordinary beings there may be, not one of them understands the field of experience, practice, or liberation of a stream-enterer.

source: །ཁྱེད་ཐམས་ཅད་ཀྱང་དེ་ལྟ་བུའི་ཡོན་ཏན་ཐོབ་པ་དང་། སྣོད་དུ་གྱུར་པར་རིང་པོར་མི་ཐོགས་པར་འགྱུར་རོ།
en: All of you will also acquire excellent qualities like his, and before long become vessels like him.”

source: །སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: It is exactly as you say, holy being!

source: སེམས་ཅན་ཇི་ལྟ་བུས་འདུལ་བ་དེ་ལྟ་བུའི་གཟུགས་ཀྱི་བར་དུ་སྤྲུལ་པར་བྱེད་དེ།
en: He manifests in whatever form is required to tame beings.

source: །ལམ་བྱི་དོར་གྱིས་ཤིག །བརྒྱན་པར་གྱིས་ཤིག །བསྟོད་པ་སྣ་ཚོགས་ཀྱིས་བསྟོད་པར་གྱིས་ཤིག
en: Sweep his path, adorn him with ornaments, and praise him in different ways.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྨན་གྱི་རྒྱལ་པོ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavān now said to the bodhisattva mahāsattva Bhaiṣajyarāja, “What you say is well spoken, well spoken indeed.

source: །རིམ་གྲོར་གྱིས་ཤིག །བསྟི་སྟང་གྱིས་ཤིག །མཆོད་པར་གྱིས་ཤིག
en: Honor, venerate, and revere him.

source: ཤིང་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་ཏེ།
en: and all the trees, made of seven precious materials,

source: དྲི་ཞིམ་པ་དང་། འདབ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུར་ལྡན་པར་སྤྲུལ་ཏོ།
en: bore delicious fragrances, leaves, flowers, and fruits.

source: །ཤིང་ལྗོན་པ་དང་། རྩྭ་དང་། སྐམ་ཤིང་དང་། འདབ་མ་ས་ལ་རྟེན་པ་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་སྤྲུལ་ཏོ།
en: He also caused all of the trees, grass, dry wood, and leaves, everything on the ground, to appear as if made of the seven precious materials.

source: །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་ན་ཡང་ནད་ནི་རབ་ཏུ་ཞི།
en: Moreover, he completely healed the diseases of the entire Sahā world.

source: སེམས་ཅན་དམྱལ་བ་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པ་རྣམས་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི།
en: He pacified all the sufferings of hell beings, and of those abiding in the animal realms and in the world of Yama, the lord of death.

source: སེམས་ཅན་དག་གིས་ཀྱང་ཟས་དང་། སྐོམ་དང་། གོས་དང་། ཆོས་གོས་དང་། རྒྱན་དག་ཐོབ་པར་གྱུར་ཏོ།
en: These beings received food, drink, clothing, Dharma robes, and ornaments.

source: །ཁ་ཅིག་ལ་ནི་མངོན་སུམ་དུ་སྤྲུལ་པ་སྤྲུལ་པར་བྱེད། ཁ་ཅིག་ལ་ནི་རྨི་ལམ་དུ་སྤྲུལ་པར་བྱེད།
en: “For some he emanates as a directly perceptible manifestation, for others he manifests in dreams.

source: །དེའི་ཚེ་གང་དག་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏེ།
en: At that moment, the wishes of all beings in the realm of the Sahā world were completely fulfilled.

source: གཟུགས་བཟང་བ། མཛེས་པ་བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་ཞིང་ཡན་ལག་ཐམས་ཅད་ནི་ཡོངས་སུ་རྫོགས།
en: They were possessed of good bodies, alluring beauty, sublime excellent complexions, and perfect limbs.

source: རྡུལ་མེད་པ་རབ་རིབ་དང་བྲལ་བའི་སྣང་བའི་དཀྱིལ་འཁོར་གྱི་འོད་ཀྱིས་ནི་མཛེས་པར་བྱས།
en: The bright radiance of an illuminating orb of light, free of dust and dimness, made them even more beautiful.

source: ཉོན་མོངས་པ་རྣམས་དང་ནི་བྲལ། སེམས་ནི་རབ་ཏུ་ཞི།
en: They were free of mental afflictions, their minds were very calm,

source: དགེ་བ་ཐམས་ཅད་ལ་ནི་སེམས་མོས།
en: inclined to every kind of virtue,

source: དཀོན་མཆོག་གསུམ་ལ་ནི་སེམས་རབ་ཏུ་དད་པར་གྱུར་ནས་
en: and their faith in the Three Jewels deepened.

source: །ནོར་བུ་རིན་པོ་ཆེ་དེ་དག་ལས་ཀྱང་རོལ་མོའི་སྒྲ་སྣ་ཚོགས་བྱུང་བར་གྱུར་ཏོ། །ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་ཡང་མངོན་པར་བབ་པར་གྱུར་ཏོ།
en: Different kinds of melodious sounds also emanated from those jewels as a rain of a multitude of jewels showered down.

source: མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་མ་ལུས་པར་སྣང་བ་ཆེན་པོ་དེས་ཁྱབ་པར་གྱུར་ཏོ།
en: The entire realm of the Sahā world was completely pervaded by that great light.

source: །སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཆེན་པོ་དང་ལྡན་ནོ།
en: He is endowed with the excellent qualities of a buddha.

source: །དེ་བས་ན་རིགས་ཀྱི་བུ་དེའི་ཡན་ལག་གི་མཆོག་མགོ་བོ་ལ་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་འདུག་པར་སྣང་ངོ་།
en: That is why a precious wish-fulfilling jewel appears on the head, the supreme part of the body of this son of noble family.”

source: འདི་ལྟ་སྟེ། རིགས་ཀྱི་བུ་ནམ་མཁའ་ནི་མ་བཅིངས་པ་མ་གྲོལ་བ།
en: “It is thus, son of noble family. The sky is neither bound nor liberated.

source: ཉོན་མོངས་པ་ཅན་མ་ཡིན་པ། མ་རྨོངས་པ། རང་བཞིན་གྱིས་དག་པའོ།
en: It is not afflicted, nor deluded, and is naturally pristine.

source: །ནམ་མཁའ་ལ་རླུང་གི་རྐྱེན་གྱིས་རྡུལ་འཐུལ་ཞིང་རླུང་གིས་དཀྲུགས་པས་ཡོངས་སུ་མ་དག་པའི་མཚན་དུ་སྣང་སྟེ།
en: The wind scatters particles of dust in the sky, and tosses them around. Thus, the sky appears impure, as dark as night.

source: ཆུས་ནི་ཞི་བར་བྱེད་ཅིང་དྲི་མ་མེད་ལ་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: Then water makes the particles fall and renders the sky stainless and completely pristine.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་དོན་དམ་པ་སྟོང་པ་ཉིད་ཀྱི་དབང་དུ་སོང་བའི་སེམས་ནི་རང་བཞིན་གྱིས་དང་བའི་ཡོངས་སུ་དག་པ་ཡིན་མོད་ཀྱི།
en: “Son of noble family, in the same way, mind—which is pervaded by emptiness, the ultimate reality of the tathāgata—is by nature utterly pristine and pure.

source: སེམས་ཅན་རྣམས་ཀྱི་བློ་བུར་དུ་བྱུང་བའི་ཉེ་བའི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་སེམས་ཉེ་བར་ཉོན་མོངས་པར་བྱས་ཏེ།
en: However, the minds of sentient beings have been defiled by adventitiously arisen afflictions.

source: དེ་དག་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་ཆུ་དང་མཚུངས་པས་ཆོས་འཆད་པར་མཛད་དོ།
en: For their benefit, the Dharma is taught out of the tathāgata’s great compassion, which is likened to water.

source: །དེ་ནས་འཁོར་དེ་དག་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོའི་བཀོད་པ་ཆེན་པོ་དེ་མཐོང་སྟེ།
en: When the assembly saw the grand display of the bodhisattva mahāsattva Ākāśagarbha,

source: །སེམས་ཉོན་མོངས་པ་ཅན་དུ་གྱུར་པའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཡོངས་སུ་སྦྱོང་བར་མཛད་པས་ཡོངས་སུ་དག་པ་དང་། དེ་དག་གི་སེམས་དྲི་མ་མེད་པར་འགྱུར་ཏེ།
en: Sentient beings’ afflicted minds are completely purified, rendering them pristine and stainless.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྐྱེས་བུ་དམ་པ་དེའི་སྟན་ཇི་ལྟ་བུར་བཤམ་སྙམ་མོ།
en: “How shall we arrange the seat of this holy being in the presence of the Bhagavān?”

source: ཤིན་ཏུ་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བའི་ཆོས་ཐོབ་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: the entire gathering had the most wonderful and marvelous experiences. They wondered,

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རིན་པོ་ཆེ་ལས་བྱས་པའི་མེ་ཏོག་པད་མ་སྡོང་བུ་ནི་དངུལ། ལོ་མ་ནི་གསེར།
en: At that very moment a lotus flower appeared in front of the Bhagavān. Made of precious substances, it had a stem of silver, leaves of gold,

source: དེའི་ཕྱིར་སེམས་ཅན་དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཉི་མ་ཤར་ནས་ཡེ་ཤེས་ཀྱི་འོད་ཟེར་གྱིས་ཚིམ་པར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་དུ་འགྱུར་ཏེ།
en: Because of this, when the sun of the tathāgata has risen, these beings will be filled with the light rays of primordial wisdom and will actualize the inconceivably excellent qualities of a buddha.

source: འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ནས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་གནས་པར་འགྱུར་རོ།
en: “Thus they will be established in the four close applications of mindfulness and so on, up to the eighth branch of the eightfold noble path.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་ལ་གནས་པར་འགྱུར་རོ།
en: They will achieve all possible qualities, up to the eighteen unique qualities of a buddha.

source: །སེམས་ཅན་ཐམས་ཅད་སྙིང་རྗེ་ཉིད་ལ་ཤིན་ཏུ་གནས་པར་འགྱུར་རོ།
en: All of these beings will be firmly rooted in compassion.

source: །དེ་དག་ལས་ཀྱང་འཇིག་རྟེན་དུ་དགྲ་བཅོམ་པ་རྣམས་འབྱུང་བར་འགྱུར་རོ།
en: From among them, arhats will appear in the world.

source: སྒྲ་དེ་གང་གི་རྣར་ཐོས་པའི་སེམས་ཅན་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: No one who heard these sounds would ever turn away from attaining complete and perfect enlightenment.

source: །རྩྭ་དང་། ཤིང་དང་། འདབ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ལ་སོགས་པ་གང་ཅི་ཡང་རུང་སྟེ་ས་ལ་རྟེན་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ལྷ་ལས་འདས་པའི་ཡན་ལག་ལྔ་དང་ལྡན་པའི་སིལ་སྙན་ལས་བསྟོད་པའི་སྒྲ་འབྱུང་བར་གྲག་སྟེ།
en: The grass, woods, leaves, flowers, fruit, and everything on the ground, too, emitted scintillating music of five qualities, even more beautiful than divine music, from which words of praise emerged.

source: རྒྱན་དེ་དག་ལས་ཀྱང་ལྷ་ལས་འདས་པའི་སིལ་སྙན་ཡན་ལག་ལྔ་དང་ལྡན་པའི་གླུའི་དབྱངས་ཀྱི་སྒྲ་འབྱུང་ངོ་།
en: From these ornaments the sound of melodious songs of the five qualities, even more beautiful than divine music, also emerged.

source: །བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་སྟེང་གི་ནམ་མཁའ་ལ་ལྷའི་ནོར་བུ་རིན་པོ་ཆེ་ལས་བྱས་པའི་ཚངས་པ་ཆེན་པོའི་གདུགས་ལྟ་བུའི་དཔག་ཚད་བརྒྱ་ཙམ་ལ་རིན་པོ་ཆེའི་དྲ་བའི་སྐུད་པ་དང་། མུ་ཏིག་གི་རྒྱན་ཕྲེང་གིས་ལེགས་པར་བརྒྱན་པ་མངོན་པར་སྤྲུལ་ཏེ།
en: He also produced a manifestation that exquisitely decorated the sky above the Bhagavān’s head. Made of jewel filigrees and garlands of pearl jewelry, vast by some hundred yojanas, it resembled the great Brahmā’s parasol of divine precious jewels.

source: ཡན་ལག་ལྔ་དང་ལྡན་པའི་སིལ་སྙན་སྒྲོགས་ཤིང་རྩེ་དགའ་ཞིང་དགའ་དགུར་སྤྱོད་པ་དེ་འདྲ་བ་དག་དེར་སྤྲུལ་ཏོ།
en: they were playing pleasant music endowed with the five qualities, and were engaging in joyful play and entertainment.

source: ཁང་པ་དེ་ན་འདོད་པའི་དབང་ཕྱུག་གི་ཆུང་མ་དམ་པ་དང་། སླས་དང་འདྲ་བ་དང་།
en: In those palaces, he manifested the lord of desire Kāmeśvara’s most sublime consort and her retinue;

source: །ལམ་དེའི་གཡས་གཡོན་གཉི་གར་རྣམ་པར་རྒྱལ་བྱེད་ཀྱི་ཁང་པ་དང་འདྲ་བ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁང་བཟངས་ཀྱང་མངོན་པར་སྤྲུལ་ཏེ།
en: On both sides of the road, right and left, he produced manifestations of residences resembling the celestial palace of Indra and divine mansions made of the seven precious materials.

source: སྙིང་པོ་ནི་རིན་པོ་ཆེ་རྡོའི་སྙིང་པོ། ཟེ་བ་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཚངས་པའི་འོད་ཟེར་ལས་བྱས་པ།
en: a core of emerald, and flower anthers made of the light of Brahmā’s precious stone.

source: རྒྱར་ནི་རྒྱང་གྲགས་གཅིག་ཙམ་ཡོད་པ།
en: Its width was about one krośa.

source: མེ་ཏོག་པད་མའི་ཟེ་བའི་སྟན་རྣམ་པ་འབུམ་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་བའི་པད་མ་བྱུང་ནས་པད་མའི་སྟེང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་པར་སྣང་ངོ་།
en: Myriad kinds of lotus anther seats emerged in front and around it. On the lotus, the bodhisattva mahāsattva Ākāśagarbha appeared, sitting cross-legged.

source: །དེའི་སྤྱི་བོ་ལ་ཡང་ནོར་བུ་རིན་པོ་ཆེ་འདུག་པར་སྣང་ངོ་།
en: On his crown there was a precious jewel.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོའི་གཡོག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་
en: Similarly, many myriads of bodhisattva mahāsattvas, servants of the bodhisattva mahāsattva Ākāśagarbha, appeared.

source: དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པ་བརྒྱ་བྱིན་ཐོགས་པའི་ནོར་བུ་རིན་པོ་ཆེས་བརྒྱན་པ་འབུམ་ཕྲག་མང་པོ་རྣམས་ཀྱང་རང་རང་གི་པད་མའི་ཟེ་བའི་སྟན་ལ་འཁོད་པར་སྣང་ངོ་།
en: Sitting on their respective lotus anther seats, they were absorbed in the meditative concentration of brave progression.

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྨན་གྱི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Each was adorned with an Indranīla jewel. The bodhisattva mahāsattva Maitreya said to the bodhisattva mahāsattva Bhaiṣajyarāja:

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲགས་ཆེན་རྣམས། །གང་དག་སྔོན་དུ་འོངས་པ་ནི། །གུས་དང་ལྡན་པས་ཕྱག་བྱས་ཏེ། །ཕྱི་ནས་སྟན་ལ་འདུག་བྱེད་ན།
en: “All bodhisattvas of great renown Respectfully pay homage First, when they arrive, And only then do they take their seats.

source: །སྐྱེས་བུ་དམ་པ་འདི་འོངས་ན། །བཀོད་ཆེན་དག་ཀྱང་བསྟན་གྱུར་ན།
en: When this great being arrived And made his grand displays,

source: །སྟོན་ལ་ཕྱག་ཀྱང་མ་བཙལ་བར། །སྟན་ལ་འདུག་པ་ལྟ་བུར་སྣང་།
en: He appeared sitting on his seat Without having prostrated to the Buddha.”

source: །རྟོག་པ་ཀུན་ལ་མི་གནས་པས། །སེམས་ཅན་དུ་ནི་མི་མཐོང་ངོ་།
en: Since he does not dwell in discursive thought, We do not see him as a sentient being.”

source: །དེ་ལྟར་སེམས་ཅན་མི་མཐོང་ན། །བཀོད་པ་ཆེ་འདི་ཅི་ཕྱིར་བསྟན།
en: We do not see him as a sentient being. If that is so, to what purpose has he made this great display?

source: །གཅིག་ལ་གཅིག་སྤྱོད་ཡུལ་མ་ལགས་སོ།
en: One is not the other’s object.

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་རྟོག་པ་མ་མཆིས་པ། སྟོང་པ་ཉིད་དང་། སྒྲོ་མ་བཏགས་པ། ཡང་དག་པའི་མཐའ་དེ་བཞིན་ཉིད་དུ་རྟོགས་པར་བགྱིའོ།
en: Bhagavān, all phenomena are to be understood in this particular way: they are devoid of concepts, they are empty, devoid of superimposition; they are the final reality and suchness.

source: །བཅོམ་ལྡན་འདས་ནམ་མཁའི་སྙིང་པོ་ནི་འདི་ལྟ་སྟེ། རང་གི་མཚན་ཉིད་ཐ་མི་དད་པ། མི་རྟོག་པ། རྣམ་པར་མི་རྟོག་པ། མི་གཡོ་བ། གསོབ་ལགས་ཏེ།
en: Bhagavān, with regard to the essence of space, it is thus. Its particular characteristic is that it is not differentiated; it is non-conceptual, completely non-conceptual, unmoving, and lacking in substance.

source: ལྟུང་བའི་དངོས་པོར་འགྱུར། མཐོ་རིས་དང་ཐར་པའི་བདེ་བ་ལས་ཕས་ཕམ་པར་འགྱུར།
en: They will be in a state of transgression and be deprived of the happiness of the higher realms and of liberation.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: rejoiced and praised the Bhagavān’s teachings.

source: །དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་འདི་ནི་ཐབས་དང་ཡེ་ཤེས་ཀྱི་ཡོན་ཏན་གྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་ནོ།
en: “Indeed, the bodhisattva mahāsattva Ākāśagarbha is endowed with the inconceivably excellent qualities of skillful means and wisdom.

source: དེ་དག་ལ་ཐོག་མར་སྐྱབས་སུ་སོང་ཞིང་མཐོང་སྟེ།
en: Having taken refuge in and seen these manifestations,

source: བདེ་བ་ཐོབ་ནས་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་གནས་པའི་བདེ་བ་ཐོབ་པའི་བར་དུ་འགྱུར་བས་དེའི་ཕྱིར་སུས་ཀྱང་དེའི་སྤྲུལ་པ་ཐམས་ཅད་ཀྱི་ཚད་གཟུང་བར་མི་ནུས་སོ།
en: these beings will obtain all forms of happiness, up to the happiness of abiding in the worlds of the higher realms. It is for this reason that no one can fathom the magnitude of all of the manifestations of Ākāśagarbha.

source: སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར།
en: and to bring about the wellbeing of sentient beings.

source: དགོངས་ཤིག་དགོངས་ཤིག །ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་གྲགས་པ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་འགྲོ་བའི་དོན་བཞེད་པ།
en: ‘Give heed, give heed to me, Ākāśagarbha of great renown, endowed with great compassion and intent on the welfare of beings!

source: ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་བདག་ལ་གཟིགས་ཤིག
en: You, who are endowed with great compassion, look upon me;

source: །བདག་འདི་ལྟ་བུ་ལས་རབ་ཏུ་ཐར་པར་མཛོད་ཅིག །སྐལ་བ་སྩོལ་ཅིག
en: liberate me from these circumstances and bestow good fortune upon me.

source: དེ་གཉི་ག་ལྟུང་བའི་རྩ་བར་འགྱུར་རོ། །འདི་ནི་ལྟུང་བའི་རྩ་བ་བདུན་པའོ།
en: Both of these actions become root transgressions. This is the seventh root transgression.

source: དེ་དག་གི་མིང་བརྗོད་པར་བྱས་ཏེ་སྨོད་པར་བྱེད། བརྙས་པར་བྱེད། ངན་དུ་རྗོད་པར་བྱེད།
en: Uttering their names, they disparage, abuse, and speak badly of them,

source: མི་དགེ་བའི་ལས་ཀྱི་ལམ་བཅུ་བླངས་ཞིང་འཇུག་པར་བྱེད།
en: embraces the ten paths of unwholesome action and engages in them,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དཔག་ཏུ་མེད།
en: Great bodhisattva mahāsattvas in numbers as limitless as the sands of the River Ganges,

source: དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་གང་ལྷ་དང་། མི་རྣམས་དང་། ཉན་ཐོས་རྣམས་དང་། གང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་།
en: Thus, with the exception of the tathāgatas, all gods and humans, śrāvakas, and bodhisattvas,

source: གང་ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་རྣམས་ཀྱི་གཟུགས་སུ་སྣང་བའི་འབྱུང་བ་ཆེན་པོ་ཇི་སྙེད་པའི་འབྱུང་བ་ཆེན་པོ་སྣང་བ་དེ་དག་
en: as well as the manifest forms of the great elements of earth, water, fire, and air—however many manifestations there were of the great elements—

source: ཐམས་ཅད་མ་ལུས་པར་སྤངས་པར་གྱུར་ཅིང་ནོར་བུ་རིན་པོ་ཆེ་སྣང་ངོ་།
en: all without exception were obliterated, and only the precious jewel remained visible.

source: སེམས་ཅན་གང་དག་དེར་འདུས་པ་དེ་དག་ཀྱང་བདག་ཀྱང་མི་མཐོང་ངོ་། །གཅིག་གིས་གཅིག་ཀྱང་མི་མཐོང་ངོ་།
en: Indeed, the sentient beings assembled there could not even see themselves, or each other.

source: །དེ་དག་ལ་འབྱུང་བ་ཆེན་པོའི་གཟུགས་སུ་སྣང་བ་ཐམས་ཅད་འགགས་ནས་ཡང་མིག་ཏུ་སྣང་བར་མ་གྱུར་ཏོ།
en: For them, all visible manifestations of the great elements also ceased and became imperceptible to the eye.

source: །བདག་བདག་གི་ལུས་ཀྱི་གཟུགས་དང་། མཚན་དང་། དབྱིབས་དང་། རིག་པ་ཡང་མི་དམིགས་པར་གྱུར་ཏེ།
en: They could not perceive their bodies, their features, or shape, nor did they have a sense of touch.

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡང་དག་པའི་མཐའ་དང་། དེ་བཞིན་ཉིད་དང་། སྟོང་པ་ཉིད་དང་ལྡན་པར་རྟོགས་པས་
en: because they realized that all phenomena are by nature endowed with final reality, suchness, and emptiness.

source: དེའི་ཕྱིར་དེ་དག་འཇིགས་པར་མི་བྱེད། དངངས་པར་མི་བྱེད། སྐྲག་པར་མི་བྱེད་དོ།
en: Therefore, they were not at all frightened, afraid, or terrified.

source: དེ་ན་འདི་ཅི་ཞིག །འདི་ཇི་ལྟ་བུ་ཞིག །འདི་ཅིའི་རང་བཞིན་ཞེས་དྲི་བ་ཡང་གང་ཡང་མི་སྣང་ངོ་།
en: In that state, they asked questions such as “What is this?”, “How did this come about?”, and “What is the nature of this?”, but could find nothing.

source: །ཡང་དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚངས་པའི་གཟེར་བུ་ཆེན་པོ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་གསོལ་པ།
en: At that time, the great bodhisattva mahāsattva known as Great Nail of Brahmā bowed down toward the Bhagavān with folded hands and said:

source: །གཟུགས་ཀྱི་ཕུང་ལ་རྟོག་བགྱིད་དེ། ། འདི་ལ་གང་ཟག་ཁ་ཅིག་ནི། །སངས་རྒྱས་ཆོས་ལ་ཐེ་ཚོམ་འཚལ།
en: Yet ordinary beings conceptualize the form aggregate. Consequently, some of these people Develop doubts about the Buddha’s teaching.

source: །བཅོམ་ལྡན་གང་དག་འདིར་ཕྱིན་པའི། །སེམས་ཅན་དག་ལ་དབུགས་དབྱུང་མཛོད།
en: O Bhagavān, please give relief To the sentient beings who have come here.

source: །སེམས་ཅན་ཡོངས་སྨིན་བགྱི་སླད་དུ། །འདི་ནི་དཔའ་བོའི་སྤྱོད་ཡུལ་ལགས།
en: Bringing them to full maturation Is the heroes’ sphere of activity.

source: དེའི་འོག་ཏུ་གཟོད་ཆོས་ཐམས་ཅད་བརྗོད་དུ་མེད་པའི་ངོ་བོ་ཉིད་མི་སྐྱེ་མི་འགག་པ། མི་དམིགས་པ་ཅུང་ཟད་ཀྱང་མེད་པའི་འདུ་བྱེད་ཐམས་ཅད་བསྒོམ་པར་བྱ་སྟེ།
en: Only then should they familiarize themselves with the idea that all phenomena are in essence inexpressible, non-arising, non-ceasing, not perceptible, and not in the slightest way existing.

source: ཕྱིན་ཅད་ཀྱང་ཆད་པ་དང་རྟག་པ་ལ་མི་གནས་པར་འགྱུར་རོ་
en: and henceforth not remain in either nihilism or eternalism.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ནས། འཁོར་དེར་ལྷགས་པ་ཐམས་ཅད་ཀྱང་སྔོན་གཟུགས་ཀྱི་སྣང་བ་ཇི་ལྟར་མཐོང་བ་དང་། ཐོས་པ་དང་། རྟོགས་པ་དང་། ཤེས་པ་དེ་བཞིན་དུ་འཁོར་དེར་མཐོང་བར་གྱུར་ཏོ།
en: No sooner had the Bhagavān spoken than all those assembled in the retinue saw the manifestations in the same way they had previously seen, heard, understood, and known them.

source: སྦྱིན་གནས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནི་སྣོད་དུ་གྱུར་པ།
en: For those sentient beings who receive donations, he transforms into a container;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ནི་ཤིང་རྟ་ལྟ་བུ།
en: for bodhisattvas, into a chariot.

source: །མཆོད་པ་དང་བཀུར་སྟི་ཐམས་ཅད་ཀྱིས་དེ་ལ་ཅི་ནུས་པར་རིན་པོ་ཆེའི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ལྷའི་གོས་དང་། རྒྱན་དང་། སྣོད་སྣ་ཚོགས་ཀྱིས་བཀུར་སྟིར་གྱིས་ཤིག
en: Using every mode of worship and respect, honor him as much as you can with jeweled umbrellas, victory banners, flags, flowers, incense, garlands, ointments, divine garments, ornaments, and vessels of many kinds.

source: །དེ་ནས་འཁོར་ལྷགས་པ་མ་ལུས་པ་མཐའ་དག་སྟན་ལས་ལངས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་ཕྱོགས་གང་ལོགས་ན་སྣང་བའི་ཕྱོགས་དེ་ལོགས་སུ་མངོན་དུ་ཕྱོགས་ནས་
en: All in the assembly without exception then rose from their seats and turned towards where the bodhisattva mahāsattva Ākāśagarbha appeared.

source: ཐལ་མོ་སྦྱར་ཏེ། སྙིང་ནི་རབ་ཏུ་དགའ། བཞིན་ནི་རབ་ཏུ་འཛུམ། མིག་ཀྱང་རབ་ཏུ་དང་བས་ལྟ་ཞིང་འདུག་པར་གྱུར་པ་དང་།
en: With overjoyed hearts, happily smiling faces, and eyes full of admiration, they stood with palms joined and gazed at him.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་དང་། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་
en: the lord of mahoragas, and hermits in possession of the five kinds of supernatural knowledge.

source: དེ་དག་ཐམས་ཅད་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ།
en: All of them were thinking the same thought,

source: བདག་ཅག་གིས་རིགས་ཀྱི་བུ་འདི་ལ་བཀོད་པའི་མཆོག་ཇི་ལྟ་བུ་ཞིག་གིས་བཀུར་སྟི་བྱ་སྙམ་མོ།
en: What kind of sublime display shall we prepare to honor him with?

source: འཁོར་དེར་ལྷགས་པའི་སེམས་ཅན་རེ་རེའི་ལག་པ་གཉིས་ཀ་ན་ཡང་ནོར་བུ་རིན་པོ་ཆེ་ཐོགས་པར་མཐོང་བར་སྤྲུལ་ནས་
en: Next, he manifested precious jewels in the hands of all the beings gathered in this assembly,

source: ནོར་བུ་རིན་པོ་ཆེ་དེ་རེ་རེ་ལས་ཀྱང་སོ་སོ་དང་འཚམ་པའི་འོད་ཟེར་གྱི་སྣང་བ་བྱུང་བར་གྱུར་ཏེ།
en: each jewel radiating its own light rays.

source: །གོས་བཟང་པོ་སྣ་ཚོགས་ཀྱི་ཆར་དང་། རྒྱན་སྣ་ཚོགས་ཀྱི་ཆར་དང་། མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་དང་། སྤོས་སྣ་ཚོགས་ཀྱི་ཆར་དང་། ཕྲེང་བ་སྣ་ཚོགས་ཀྱི་ཆར་དང་། གདུགས་སྣ་ཚོགས་ཀྱི་ཆར་དང་། སྣོད་སྣ་ཚོགས་ཀྱི་ཆར་དང་། འབྲས་བུ་སྣ་ཚོགས་ཀྱི་ཆར་ཡང་བབ་པར་གྱུར་ཏོ།
en: Rains of various fine garments, of ornaments, of flowers, incense, garlands, parasols, vessels, and of fruit also showered down.

source: །ལྷའི་གོས་དང་། ཆོས་གོས་དང་། གསེར་གྱི་སྐུད་པ་དང་། མུ་ཏིག་གི་སེ་མོ་དོ་དང་། མེ་ཏོག་པད་མ་དང་། ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། ཨུ་ར་ག་ས་ལ་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དང་། ཤིང་ཏ་མ་ལའི་འདབ་མ་དང་། ཙན་དན་ས་མཆོག་པའི་བྱེ་མས་ལམ་དེར་བཀྲམ་པར་མངོན་པར་སྤྲུལ་ཏོ།
en: He produced manifestations of divine garments, Dharma robes, golden threads, and pearl necklaces; of lotus flowers, utpala flowers, jasmine, and white lotuses; of uragasala trees, snake-heart sandalwood, tamāla tree leaves, and of white sandalwood powder scattered along the path.

source: སྐྱེས་བུ་དམ་པ་འདི་ཉིད་ནི། །སངས་རྒྱས་ཆོས་ལ་རབ་གནས་མཐོང་།
en: We see that this great being Dwells excellently in the Buddhadharma.

source: ཡང་དག་མཐའ་ལ་གནས་པའི་ཕྱིར།
en: Since he abides in final reality,

source: །ཐེ་ཙོམ་གྱུར་པ་བཤད་པར་མཛོད།
en: I am afflicted by doubts: please explain further!

source: ཀུན་ཏུ་རྟོག་པའི་སྤྱོད་ཡུལ་ཅན། །བྱིས་པས་དོན་དམ་མི་ཤེས་ཏེ།
en: Immature beings do not understand ultimate reality; Their experience is a complete mental construction.

source: །སེམས་ཅན་ཡོངས་སྨིན་བྱ་བའི་ཕྱིར། །འདི་ནི་དཔའ་བོའི་ཐབས་ཡིན་ནོ།
en: This is a hero’s method That brings these sentient beings to maturity.

source: །དོན་དམ་གྱིས་ནི་སྡུག་བསྔལ་བ། །དེ་དག་རབ་ཏུ་དགྲོལ་བའི་ཕྱིར།
en: By means of ultimate reality Suffering beings will be completely freed.

source: །སྨན་གྱི་རྒྱལ་པོས་སྨྲས་པ།
en: Bhaiṣajyarāja replied:

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་སྨྲས་པ།
en: Bodhisattva Maitreya asked:

source: །མཁས་པས་ཀུན་རྫོབ་བདེན་པ་ཡིས། །འདི་འདྲ་བ་ཡི་བཀོད་པ་བསྟན།
en: To this end, by means of relative truth, the skillful ones Manifest displays such as this one here.

source: །དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་ཀྱིས་ཀྱང་ཕྱིར་མི་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་རྣམས་ཀྱིས་ཀྱང་དགྲ་བཅོམ་པ་དང་། དགྲ་བཅོམ་པ་རྣམས་ཀྱིས་ཀྱང་རང་སངས་རྒྱས་ཀྱི་མི་ཤེས་ཏེ།
en: Similarly, once-returners would not understand non-returners, non-returners would not understand arhats, and arhats would not understand pratyekabuddhas.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་གཅིག་གི་སྤྱོད་ཡུལ་དང་། རྣམ་པར་གྲོལ་བ་དང་། དོན་དམ་པ་ལ་བརྟག་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྦྱོར་བ་མི་ཤེས་སོ།
en: none of them would understand the field of experience of a single bodhisattva who has attained acceptance that phenomena are non-arising, nor his liberation, his analysis of ultimate reality, or his practice of bringing sentient beings to complete spiritual maturity.
